<?
 /***********************************************************************************
 *** 프로 젝트 : CyPress
 *** 개발 영역 : 로그인
 *** 개  발  자 : 김성진
 *** 개발 날짜 : 2016.06.15
 ***********************************************************************************/

 /***********************************************************************************
 *** 기본 인클루드
 ***********************************************************************************/

 $curDirectory = dirname(__FILE__);
 require_once $curDirectory."/config/set/webinfo/init.php";
 require_once $curDirectory."/config/lib/local/include.php";


 /***********************************************************************************
 *** 리퀘스트
 ***********************************************************************************/

 $id  = $CCommon->STags($CRequest->GetValue("id"));
 $passwd  = $CCommon->STags($CRequest->GetValue("passwd"));


  /***********************************************************************************
 *** 변수값 유무 체크
 ***********************************************************************************/

 if (strlen($id) <= 0 && strlen($passwd) <= 0) {
	 echo "Res="._CYP_LOG_ERR_CD_01."&"._CYP_LOG_ERR_DC_01;
	 exit;
 } else if (strlen($id) <= 0) {
	 echo "Res="._CYP_LOG_ERR_CD_02."&"._CYP_LOG_ERR_DC_02;
	 exit;
 } else if (strlen($passwd) <= 0) {
	 echo "Res="._CYP_LOG_ERR_CD_03."&"._CYP_LOG_ERR_DC_03;
	 exit;
 }


 /***********************************************************************************
 *** 변수 정의
 ***********************************************************************************/

 $rData['usr_id']  = $id;
 $rData['usr_pw']  = $passwd;


 /***********************************************************************************
 *** 모듈 인클루드
 ***********************************************************************************/

 require_once _MOD_DIR."/mod_members.php";
 $CMembers = new CLS_Members;

 require_once _PLG_DIR.'/PasswordEncrypt.php';


 /***********************************************************************************
 *** 회원 로그인 정보 체크
 ***********************************************************************************/
 $chkpass = $CMembers->getPassWDCheck(_DB_SERVER, $rData);
 $mbRes = $CMembers->getEmplLoginCheck(_DB_SERVER, $rData);


 /***********************************************************************************
 *** 결과
 ***********************************************************************************/

 if (is_array($mbRes)) {
	 //if (password_verify($rData['usr_pw'], $mbRes['passwd']) == false) {
     if ($chkpass != $mbRes['passwd']) {
		 $nRes = _CYP_LOG_ERR_CD_05."&"._CYP_LOG_ERR_DC_05;
    } else {
		 $nRes = _CYP_SUCCESS;
		 $nName = $mbRes['name'];
	}
 } else if ($mbRes == "FAILED") {
	 $nRes = _CYP_LOG_ERR_CD_04."&"._CYP_LOG_ERR_DC_04;
 } else if ($mbRes == "ERROR") {
	 $nRes = _CYP_COMM_ERR_CD_01."&"._CYP_COMM_ERR_DC_01;
 } else {
	 $nRes = _CYP_COMM_ERR_CD_02."&"._CYP_COMM_ERR_DC_02;
 }


  /***********************************************************************************
 *** 출력
 ***********************************************************************************/

 echo "Res=".$nRes."\n";

 if ($nRes == "0") {
	 echo "[Account]\n";
	 echo "Name=".$nName."\n";
 }

?>