<?
 /***********************************************************************************
 *** 프로 젝트 : CyPress
 *** 개발 영역 : 프리셋 유효성 검사
 *** 개  발  자 : 김성진
 *** 개발 날짜 : 2016.09.27
 ***********************************************************************************/

/***********************************************************************************
 *** 기본 인클루드
 ***********************************************************************************/
define("INC_PATH", $_SERVER["INC"]);
include_once(INC_PATH . "/define/nimda/cypress_init.inc");
include_once(INC_PATH . "/com/nexmotion/common/util/ConnectionPool.inc");
include_once(INC_PATH . "/com/nexmotion/common/entity/FormBean.inc");
include_once($_SERVER["DOCUMENT_ROOT"] . "/cypress/process/dao/mod_preset_dao.php");
include_once(INC_PATH . "/common_lib/cypress_com.inc");
include_once(INC_PATH . "/common_lib/cypress_file.inc");


/***********************************************************************************
 *** 클래스 선언
 ***********************************************************************************/

$connectionPool = new ConnectionPool();
$conn = $connectionPool->getPooledConnection();
$fb = new FormBean();
$CPreset = new CLS_Preset;
$CCommon = new CLS_Common;
$CCFile = new CLS_File;


/***********************************************************************************
 *** 리퀘스트
 ***********************************************************************************/

$PRC  = $fb->form("PRC");   // 프리셋 카테고리 이름
$PRN  = $fb->form("PRN");   // 프리셋 이름


/***********************************************************************************
 *** 변수값 유무 체크
 ***********************************************************************************/

if (strlen($PRC) <= 0) {
    echo "Res="._CYP_PRES_NUM_ERR_CD_01."&"._CYP_PRES_NUM_ERR_DC_01;
    exit;
}

if (strlen($PRN) <= 0) {
    echo "Res="._CYP_PRES_NUM_ERR_CD_02."&"._CYP_PRES_NUM_ERR_DC_02;
    exit;
}


/***********************************************************************************
*** 변수선언
***********************************************************************************/

$rData['prc'] = $PRC;           // 프리셋 카테고리 이름
$rData['prn'] = $PRN;           // 프리셋 이름


/***********************************************************************************
 *** 기존 판형 체크
 **********************************************************************************/

$getRes = $CPreset->getPresetInfoDataValue($conn, $rData);


/***********************************************************************************
 *** 데이터 존재유무에 따라 삽입 또는 업데이트
 **********************************************************************************/

if ($getRes == "UPDATE") {
    $nRes = _CYP_SUCCESS;
} else if ($getRes == "INSERT") {
    $nRes = _CYP_PRES_NUM_ERR_CD_02."&"._CYP_PRES_NUM_ERR_DC_02;
} else {
    $nRes = _CYP_COMM_ERR_CD_01."&"._CYP_COMM_ERR_DC_01;
}


/***********************************************************************************
 *** DB 컨넥션 종료
 ***********************************************************************************/

$conn->close();


/***********************************************************************************
 *** 출력
 ***********************************************************************************/

echo "Res=".$nRes."\n";

?>