<?
 /***********************************************************************************
 *** 프로 젝트 : CyPress
 *** 개발 영역 : DB Info
 *** 개  발  자 : 김성진
 *** 개발 날짜 : 2016.06.15
 ***********************************************************************************/

 /***********************************************************************************
 *** DB 서버 선택  (홈페이지 DB : web)
 ***********************************************************************************/

 class CLS_DBSet {

	var $host;
	var $user;
	var $passwd;
	var $name;
	var $alias;
	var $charset;
	var $collate;


	/***********************************************************************************
	*** 변수 초기화
	***********************************************************************************/

	function Init() {
		$this->host    = null;
		$this->user    = null;
		$this->passwd  = null;
		$this->name    = null;
		$this->alias   = null;
		$this->charset = null;
		$this->collate = null;
	}


	/***********************************************************************************
	*** DB 정보
	***********************************************************************************/

	function CLS_DBSet($_DB_SERVER) {
		$this->Init();

        if ($_DB_SERVER == "web") {

			$this->host = "211.110.168.85";
			$this->user = "dpuser01";
			$this->passwd = "gpdb2021";
			$this->name = "gprinting";
			$this->alias = null;
			$this->charset = "utf8";
			$this->collate = "utf8_general_ci";

		 } else {

			 die("DB Server Info Lost!!");
			 exit;

		 }
    }
 }
?>